Revit 2026 API

# WaterWaterBumpAmount Property

---

The property labeled "Wave Height" from the "Water" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WaterBumpAmount { get; }
```
```vb
Public Shared ReadOnly Property WaterBumpAmount As String
	Get
```
```cpp
public:
static property String^ WaterBumpAmount {
	String^ get ();
}
```
```fsharp
static member WaterBumpAmount : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 5".

#### Reference

Water Class

Autodesk.Revit.DB.Visual Namespace